# Getting Started with pandas

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## Introduction to pandas Data Structures

### Series

In [59]:
obj = pd.Series([4, 7, -5, 3])
print(obj)
pd.DataFrame(obj)
# regular print formar vs. DataFrame format

0    4
1    7
2   -5
3    3
dtype: int64

   0
0  4
1  7
2 -5
3  3

In [14]:
# to get Descriptive information about the dataset
obj.values

array([ 4,  7, -5,  3])

In [17]:
obj.keys

<bound method Series.keys of 0    4
1    7
2   -5
3    3
dtype: int64>

In [12]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [27]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(obj2)
obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [28]:
obj2['a']
# returns value corr. to where index = 'a'

-5

In [29]:
obj2[['c', 'a', 'd']]
# returns values corr. to where index = 'c', 'a', & 'd' in the order we specify, rather than order of data set

c    3
a   -5
d    4
dtype: int64

In [25]:
obj2['d'] = 6
print(obj2)
# substitute value of 'd' from 4 to 6

d    6
b    7
a   -5
c    3
dtype: int64

In [30]:
obj2[obj2 > 0]
# returns indexes where value meets condition (y > 0)

d    4
b    7
c    3
dtype: int64

In [31]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [32]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [40]:
'b' in obj2
'e' in obj2
# searching for specified KEY in dataset
# 'e' is NOT in obj2. 
# Faulty results when using this method to search for values. must use this code for value:
obj2['b']

7

In [144]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
print(sdata)
# initialize data as a dictionary
obj3 = pd.Series(sdata)
# create new var to reformat dictionary as Pandas series
obj3

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [47]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
# creating new var that is the sdata series with the specified index as the 'states' list
# states list is now the key/index
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
pd.isnull(obj4)
# locate indexes where value is null

# SAME AS 
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
pd.notnull(obj4)
# locate indexes where value is NOT null

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [54]:
print(obj3)
print(obj4)
obj3 + obj4
# returns sum where keys in each series match.
# returns NaN where keys don't show up --> no match --> nothing to sum

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [57]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4
# built-in name function assigns names to the series (obj4 named 'population') 
# & index (index named 'states')

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [60]:
print(obj)
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj
# takes original obj series and changes index to 'Bob'...
# returns updated series with new indexes (keys) and same values

0    4
1    7
2   -5
3    3
dtype: int64

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [80]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# creating dictionary with state, year, and population
frame = pd.DataFrame(data)
# creating new var. that is a Pandas DataFrame of the dictionary
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [81]:
frame.head(2)
# returns first two rows of dataset to give an idea of the contents

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [82]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])
# reorganize columns in 'data' as specified

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [87]:
print('original frame index is', frame.index)

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
# creating new var. that adds a new index 'debt' and changes index to string of values
print('frame2 index is', frame2.index)

original frame index is RangeIndex(start=0, stop=6, step=1)
frame2 index is Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [91]:
print(frame2)
frame2.columns

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [86]:
frame2['debt'] = 16.5
frame2
# assigns 16.5 to all rows in column 'debt'
# unsure how to set values for debt using indexing

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [92]:
frame2['state']
# returns index and 'state' column only

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [94]:
frame2.year
frame2['year']
# same method as above, different syntax
# returns index and 'year' column values only

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [96]:
frame2.loc['three']
# within frame2, LOCATE index 'three'

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [101]:
frame2['debt'] = 16.5
frame2
frame2['debt'] = np.arange(6.)
frame2
# all values in column 'debt' were originally assigned 16.5
# defines all values in column along range 0-6 (float)

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [102]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
# creating new var. to add values to index (rows) named 'two', 'four', & 'five'
frame2['debt'] = val
# assigns val to frame2 'debt' column, onlu in specified indices
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [103]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2
# creates new column in series that returns where state column == 'Ohio'

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [104]:
del frame2['eastern']
frame2.columns
# delete column in series named 'eastern'

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [105]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# create dictionary 'pop'
frame3 = pd.DataFrame(pop)
# convert dictionary pop to DataFrame
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [106]:
frame3.T
# transpose = rows become columns; columns become rows

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [107]:
pd.DataFrame(pop, index=[2001, 2002, 2003])
# return values in pop where index is ^
# NaN for 2003 because there is no index for that year

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [110]:
print(pd.DataFrame(frame3))

pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index Objects

In [118]:
obj = pd.Series(range(3))
# creating series with specified range.
obj.index
# no specified index --> Python uses default numbering

RangeIndex(start=0, stop=3, step=1)

In [123]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
# creating series with specified range AND specified index
index
index[1:]

Index(['b', 'c'], dtype='object')

In [128]:
labels = pd.Index(np.arange(3))    # creating var that is an index of an array range 3
print(labels)
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels
# ERROR when index count in labels =/= necessary index for obj2

Int64Index([0, 1, 2], dtype='int64')

True

In [131]:
frame3
frame3.columns
'Ohio' in frame3.columns    # is Ohio the name of a column (T)
2003 in frame3.index        # is 2003 the name of an index (F)

False

In [132]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [140]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [136]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2
# .reindex to edit the specified index of the series and introduce more indices that may return nulls

#SIMILAR TO
obj2.index = ['a', 'b', 'c', 'd']
# BUT this method can only MATCH the number of values
# will return error when there are more not enough existing values to match the updated indices

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [145]:
print(obj3)
#original series

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [150]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3)
# assigning new index and values in obj3 series

0      blue
2    purple
4    yellow
dtype: object

In [152]:
obj3.reindex(range(6))
# update index of series to run along range 6

obj3.reindex(range(6), method='ffill')
# update index of series to run along range 6, using specified method 'ffill' to populate (avoids nulls)

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [153]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [154]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2
# .reindex is able to function even when index does not exist --> returns NaN for that index (avoids error)

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [157]:
fruits = ['apple', 'orange', 'ban']
frame.reindex(columns=fruits)
# DataFrame filled with NaNs because original 'frame' fxn (153) did not have corr. values for these columns

   apple  orange  ban
a    NaN     NaN  NaN
c    NaN     NaN  NaN
d    NaN     NaN  NaN

In [159]:
states = ['Texas', 'Utah', 'California', 'Ohio']
frame.reindex(columns=states)
# similar to reindex, allows us to redefine column names & order
# BUT will need to assign values for the unmatched

   Texas  Utah  California  Ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

In [168]:
frame.loc[['a', 'b', 'c', 'd', 'e'], states]

KeyError: "['b', 'e'] not in index"

### Dropping Entries from an Axis

In [185]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
print(obj)
new_obj = obj.drop('c')
# delete values for a single index 'c'
new_obj
obj.drop(['d', 'c'])
# delete values for multiple indices --> .drop([LIST INDICES])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [174]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data.drop(['Colorado', 'Ohio'])
# delete values for those indices

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data.drop('two', axis = 1)
# to operate on columns, must specify AXIS = 1 or 'columns'
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [186]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [189]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj)
obj['b']    # obj('b') SAME AS calling obj[1] in positional index format
obj[1]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

1.0

In [190]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [191]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [193]:
obj[[0, 2]]
# return values in position 0 and 2

a    0.0
c    2.0
dtype: float64

In [195]:
obj['b':'d']
# can use index keys SAME AS positional index

b    1.0
c    2.0
d    3.0
dtype: float64

In [196]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [199]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data)
data[['three', 'one']]
# telling Python which columns we want to view (subset)
# taking a subset of data is similar to .drop

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [204]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [205]:
data[data['three'] > 5]
# within dataframe 'data', return rows for which values in column 'three' > 5

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
data[:2]
# return first 2 rows

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [209]:
data < 5
# return which values in DataFrame meet the condition

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [210]:
data[data < 5] = 0
# in data, assign values <5 to 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [211]:
data.loc['Colorado', ['two', 'three']]
# LOCATE values for 'Co' in columns named 'two' and 'three'

two      5
three    6
Name: Colorado, dtype: int64

In [213]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [214]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [215]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [216]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [217]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [231]:
ser = pd.Series(np.arange(3.))
ser
print(ser.index)
ser[-1]    # returns error for negative index because the default index in Python starts at 0, unless we specify otherwise

RangeIndex(start=0, stop=3, step=1)

In [227]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
print(ser2)
ser2[-1]
# specified index allows us to do negative indexing as well

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [234]:
print(ser[:1])
print(ser.loc[:1])
print(ser.iloc[:1])

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64
0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [241]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
print(s1)
pd.DataFrame(s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

     0
a -2.1
c  3.6
e -1.5
f  4.0
g  3.1

In [242]:
s1 + s2
# computes along indices that exist in both series --> a,c,e | d,f,g not present in both series

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [248]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [249]:
df1 + df2
# computes along indices that exist in both series --> only OH and TX

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [250]:
df1 - df2

            b   c    d   e
Colorado  NaN NaN  NaN NaN
Ohio     -3.0 NaN -2.0 NaN
Oregon    NaN NaN  NaN NaN
Texas    -3.0 NaN -2.0 NaN
Utah      NaN NaN  NaN NaN

In [252]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1 - df2
# no matching indices between both series

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [255]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
print(df1)
df2.loc[1, 'b'] = np.nan
# <row, column> notation. replace that specific coordinate with np.NaN
df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [254]:
df1 + df2
# index row 3 does not exist in both series
# column 'e' does not exist in both series

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [262]:
df1.add(df2, fill_value=0)
# unsure of output

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [257]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [258]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [260]:
print(df1)
df1.reindex(columns=df2.columns, fill_value=0)
# updating indices (COLUMNS specifically) in df1 with columns from df2 --> unmatched column is 'e', appended and 
# filled with fill_value 0

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [267]:
arr = np.arange(12.).reshape((3, 4))
print(arr)
arr - arr[0]
# subtracts each value in arr by the corresponding index value of arr[0]

[[ 0.  1.  2.  3.]
 [ 4.  5.  6.  7.]
 [ 8.  9. 10. 11.]]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [268]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [271]:
series = frame.iloc[0]
series
# returns values in row index 0 (corr. to Utah)

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [272]:
frame - series
# subtracts values in row index 0 (Utah) from frame

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [273]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [274]:
frame + series2
# 'f' is the newest column added from series2
# because there is no existing match, summed values are NaN

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [278]:
print(frame)
series3 = frame['d']
series3

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [293]:
frame.index
frame['Utah']
# unsure of reason for error when trying to SELECT

KeyError: 'Utah'

In [294]:
frame
series3
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [ ]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

In [ ]:
f = lambda x: x.max() - x.min()
frame.apply(f)

In [ ]:
frame.apply(f, axis='columns')

In [ ]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

In [ ]:
format = lambda x: '%.2f' % x
frame.applymap(format)

In [ ]:
frame['e'].map(format)

### Sorting and Ranking

In [297]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
print(obj)
obj.sort_index()
# original series has indices out of order
# .sort_index() tells Python to perform SORT operation on the INDEX of series obj

d    0
a    1
b    2
c    3
dtype: int64

a    1
b    2
c    3
d    0
dtype: int64

In [300]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
x = frame.sort_index()
# default is to operate on rows first, unless axis = 1 specified
# with strings, Python sorts in ALPHABETICAL order

y = frame.sort_index(axis=1)

x+y    # x+y is re-sorted array

        a   b   c  d
one    10  12  14  8
three   2   4   6  0

In [301]:
frame.sort_index(axis=1, ascending=False)
# default settings: operating on ROWS in ASCENDING
# line sorts columns in DESCENDING order

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [302]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()
# sorts values by rearranges indices

2   -3
3    2
0    4
1    7
dtype: int64

In [303]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()
# NaN entries are relegated to the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [306]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame
frame.sort_values(by='b')
# column b is sorted in ascending order by rearranging indices

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [307]:
frame.sort_values(by=['a', 'b'])
# sort by 'a' first THEN 'b'

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [308]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()
# compares each value to other values in the whole series
# values in positions 0 and 2 are tied for  highest rank
# index 1 has the lowest rank (negative value)

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [309]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [310]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [311]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')
# ranks the values within each column compared to the rest of the column

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [312]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [313]:
obj.index.is_unique
# tests if there are unique keys

False

In [315]:
obj['a']
# returns multiple values for one key due to duplicate entries

a    0
a    1
dtype: int64

In [316]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df
df.loc['b']

          0         1         2
b  0.092908  0.281746  0.769023
b  1.246435  1.007189 -1.296221

## Summarizing and Computing Descriptive Statistics

In [317]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [318]:
df.sum()
# returns sum of each column

one    9.25
two   -5.80
dtype: float64

In [319]:
df.sum(axis='columns')
# returns sum across ALL columns for each index

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [324]:
df.mean(axis='columns', skipna=False)
# computes and returns mean across ALL columns for each index
# skipna --> skip computing of NaN values? Y/N = T/F

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [325]:
df.idxmax()

one    b
two    d
dtype: object

In [326]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [329]:
df.describe([0])

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
0%     0.750000 -4.500000
50%    1.400000 -2.900000
max    7.100000 -1.300000

In [330]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

conda install pandas-datareader

In [ ]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [ ]:
returns = price.pct_change()
returns.tail()

In [ ]:
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

In [ ]:
returns.MSFT.corr(returns.IBM)

In [ ]:
returns.corr()
returns.cov()

In [ ]:
returns.corrwith(returns.IBM)

In [ ]:
returns.corrwith(volume)

### Unique Values, Value Counts, and Membership

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [ ]:
uniques = obj.unique()
uniques

In [ ]:
obj.value_counts()

In [ ]:
pd.value_counts(obj.values, sort=False)

In [ ]:
obj
mask = obj.isin(['b', 'c'])
mask
obj[mask]

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

## Conclusion

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS